app/views/beer_clubs/show.html.erb

SELECT  1 AS one FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."beer_club_id" = ? AND "users"."id" = ? LIMIT ?  [["beer_club_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."beer_club_id" = ?  [["beer_club_id", 1]]
---

<% if (current_user) && (not @beer_club.users.include?(current_user))%>