app/views/ratings/_recent_ratings.html.erb

SELECT "ratings".* FROM "ratings"
---
<% newRatings = Rating.all.sort { |a, b| a.created_at <=> b.created_at } %>