app/views/ratings/_top_users.html.erb

<% sortedUsers = User.all.sort { |a, b| b.ratings.count <=> a.ratings.cont } %>
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."user_id" = ?  [["user_id", 1]]