app/views/ratings/new.html.erb

SELECT "beers".* FROM "beers"
---
    <div class="field">
      beer: <%= f.select :beer_id, options_from_collection_for_select(@beers, :id, :to_s, selected: @rating.beer_id) %>