app/views/breweries/_brewery.json.jbuilder


json.beers brewery.beers.count
---
SELECT COUNT(*) FROM "beers" WHERE "beers"."brewery_id" = ?  [["brewery_id", 1]]