app/views/beers/_form.html.erb

    <%= f.label :style_id %>
    <%= f.select :style_id, options_from_collection_for_select(@styles, :id, :name, selected: beer.style_id) %>
---
SELECT "styles".* FROM "styles"

    <%= f.label :brewery_id %>
    <%= f.select :brewery_id, options_from_collection_for_select(@breweries, :id, :name, selected: beer.brewery_id) %>
---
SELECT "breweries".* FROM "breweries"