app/views/beers/show.html.erb

<p>
  <% if @beer.ratings.empty? %>
---
SELECT  1 AS one FROM "ratings" WHERE "ratings"."beer_id" = ? LIMIT ?  [["beer_id", 1], ["LIMIT", 1]]
SELECT "ratings".* FROM "ratings" WHERE "ratings"."beer_id" = ?  [["beer_id", 1]]