app/controllers/beers_controller.rb

  def create
    ensure_that_signed_in
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save
---
INSERT INTO "beers" ("name", "brewery_id", "created_at", "updated_at", "style_id") VALUES (?, ?, ?, ?, ?)  [["name", "testahol"], ["brewery_id", 1], ["created_at", 2017-02-16 08:23:25 UTC], ["updated_at", 2017-02-16 08:23:25 UTC], ["style_id", 1]]

  def destroy
    ensure_that_signed_in_as_admin
    @beer.destroy
---
DELETE FROM "beers" WHERE "beers"."id" = ?  [["id", 15]]