app/controllers/beer_clubs_controller.rb

  def create
    ensure_that_signed_in
    @beer_club = BeerClub.new(beer_club_params)

    respond_to do |format|
      if @beer_club.save
---
INSERT INTO "beer_clubs" ("name", "founded", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Lassilan loistavat"], ["founded", 2017], ["city", "Helsinki"], ["created_at", 2017-02-01 07:52:16 UTC], ["updated_at", 2017-02-01 07:52:16 UTC]]