app/controllers/beers_controller.rb

  def create
    ensure_that_signed_in
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save
---
INSERT INTO "beers" ("name", "style", "brewery_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Testahol"], ["style", "Weizen"], ["brewery_id", 1], ["created_at", 2017-02-08 08:52:20 UTC], ["updated_at", 2017-02-08 08:52:20 UTC]]