app/controllers/breweries_controller.rb

SELECT "breweries".* FROM "breweries"
---
  def index
    @active_breweries = Brewery.active
    @retired_breweries = Brewery.retired
    @breweries = Brewery.all

SELECT  "breweries".* FROM "breweries" WHERE "breweries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "breweries" SET "active" = ?, "updated_at" = ? WHERE "breweries"."id" = ?  [["active", false], ["updated_at", 2017-02-24 07:26:34 UTC], ["id", 1]]
---
  def toggle_activity
    brewery = Brewery.find(params[:id])
    brewery.update_attribute :active, (not brewery.active)

INSERT INTO "breweries" ("name", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Panimo 1"], ["year", 1], ["created_at", 2017-01-17 10:43:02 UTC], ["updated_at", 2017-01-17 10:43:02 UTC]]
---
  def create
    ensure_that_signed_in
    @brewery = Brewery.new(brewery_params)

    respond_to do |format|
      if @brewery.save