app/controllers/memberships_controller.rb

SELECT "beer_clubs".* FROM "beer_clubs"
---
  def new
    redirect_to new_session_path unless current_user
    @membership = Membership.new
    @BeerClubs = BeerClub.all - current_user.beer_clubs

SELECT  "beer_clubs".* FROM "beer_clubs" WHERE "beer_clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "memberships" ("user_id", "beer_club_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["beer_club_id", 1], ["created_at", 2017-02-01 07:56:18 UTC], ["updated_at", 2017-02-01 07:56:18 UTC]]
---
  def create
    @membership = Membership.new(membership_params)

    if current_user.nil?
      redirect_to login_path
    else
      @membership.user = current_user
    end

    if current_user.beer_clubs.include?(BeerClub.find_by(id: params[:beer_club_id]))
      redirect_to @membership.beer_club
    end


    respond_to do |format|
      if @membership.save

SELECT  "memberships".* FROM "memberships" WHERE "memberships"."user_id" = ? AND "memberships"."beer_club_id" = ? LIMIT ?  [["user_id", 1], ["beer_club_id", 2], ["LIMIT", 1]]
DELETE FROM "beer_clubs" WHERE "beer_clubs"."id" = ?  [["id", 1]]
DELETE FROM "memberships" WHERE "memberships"."id" = ?  [["id", 1]]
---
  def destroy

    @membership = current_user.memberships.find_by(beer_club_id:params[:membership][:beer_club_id])

    @membership.destroy