app/controllers/ratings_controller.rb

  def create
    @rating = Rating.new params.require(:rating).permit(:score, :beer_id, :user_id)
    if current_user.nil?
      redirect_to signin_path, notice: 'you should be signed in'
    end
    if @rating.save
      current_user.ratings << @rating
      redirect_to user_path current_user
    else
      @beers = Beer.all
---
INSERT INTO "ratings" ("score", "beer_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["score", 15], ["beer_id", 8], ["created_at", 2017-02-03 09:39:32 UTC], ["updated_at", 2017-02-03 09:39:32 UTC], ["user_id", 1]]
SELECT "beers".* FROM "beers"

  def destroy
    rating = Rating.find params[:id]
    rating.delete if current_user == rating.user
---
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "ratings" WHERE "ratings"."id" = ?  [["id", 12]]