app/controllers/styles_controller.rb

    def set_style
      @style = Style.find(params[:id])
---
SELECT  "styles".* FROM "styles" WHERE "styles"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]