app/controllers/users_controller.rb

  def toggle_block
    ensure_that_signed_in_as_admin
    user = User.find(params[:id])
    user.update_attribute :blocked, (not user.blocked)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "blocked" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["blocked", true], ["updated_at", 2017-02-24 08:09:54 UTC], ["id", 1]]

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)  [["username", "test"], ["created_at", 2017-02-03 08:10:47 UTC], ["updated_at", 2017-02-03 08:10:47 UTC], ["password_digest", "$2a$10$H63V.y2qMf9VQr0v7BMhKupV4rkVMCrx8mN3g/ayZKoulEq/dUCG2"]]

  def destroy
    if @user == current_user
      @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]